# IsOrphaned Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementTag..::..IsOrphaned Property
SpatialElementTag Class See Also
---
Identifies if the tag is orphaned or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsOrphaned { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsOrphaned As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsOrphaned {
	bool get ();
}
```

# Remarks
The orphan tags are used to tag a spatial element in a link document, but the spatial element was deleted.
# See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace